{
  "deposit": "50000000ugovgen",
  "description": "# Equitable ATONE Distribution in the Spirit of AtomOne's Founding Principles\n\n[Original draft](https://github.com/atomone-hub/govgen-proposals/blob/main/001_ATONE_DISTRIBUTION.md)\n\n## Summary\n\nThis proposal seeks to establish a fair and principled distribution mechanism \nfor ATONE, the native token of the AtomOne chain, reflecting the foundational \nprinciples as outlined in the AtomOne \n[founding documents](https://github.com/atomone-hub/genesis).\nThe proposal tries to synthesize the \n[discussion](https://github.com/atomone-hub/genesis/issues/12)\naround the ATONE distribution, and leveraging the snapshot from Cosmos Hub's\n[proposal 848](https://www.mintscan.io/cosmos/proposals/848), \nit aims to reward participation and engagement while adhering to AtomOne's ethos\nof intelligent distribution and governance.\n\n\u003e [!NOTE]\n\u003e This “Sentiment Proposal” is intended solely to assess the opinions and\n\u003e ideas of the GovGen community regarding the future of AtomOne. As such, the\n\u003e results of the vote on this Sentiment Proposal are not intended to be, and\n\u003e will not be, binding or determinative in any way.\n\u003e\n\u003e It is the proposal submitter's understanding and hope that the GovGen\n\u003e community will be able to use the results of this and other Sentiment\n\u003e Proposals to develop in the future a binding decision-making/governance\n\u003e process to be determined (potentially including an upgrade to GovGen's\n\u003e software) with a goal of shaping the potential AtomOne chain. At this early\n\u003e stage, this and other Sentiment Proposals are anticipated to be introduced\n\u003e with an intention to better understand the GovGen community’s general\n\u003e preferences and views, and also to measure the ratio of active participants\n\u003e to help determine the quorum for future proposals.\n\n## Context\n\nAtomOne's inception was driven by fundamental disagreements within the Cosmos\nHub's community, particularly regarding the nature of ATOM as a staking versus\nmonetary token and the broader vision for the network's future\n[1](https://github.com/atomone-hub/genesis/blob/main/README.md)\n[2](https://github.com/atomone-hub/genesis/blob/main/STAKING_VS_MONEY.md).\nProposal 848's passage, advocating for ATOM's \"*halving*\" without adequately\naddressing security concerns, marked a pivotal moment that underscored the\nnecessity for AtomOne. AtomOne is thus not merely a technical divergence but\nrather a philosophical stand for a network that remains true to the principles\nof minimalism in its IBC/ICS hub functionality, robust security model, and an\nintelligent, aligned community governance structure.\n\n## Decision\n\nIn accordance with AtomOne's foundational principles and the discussions\nsurrounding the token distribution, we propose the ATONE distribution mechanism\noutlined below, reflecting an attempt to create a balanced approach that rewards\nparticipation, engagement, and alignment with AtomOne's vision. The intent of\nthe distribution mechanism is to *increase* the percentage ownership in the\nnetwork for the *NO* and *No With Veto* (NWV) votes on proposal 848, but to also\nensures that the percentage ownership of the non-voting categories does not\nexceed a fixed 1/3 of the total supply. A decimation factor is also applied at\nthe end to reduce the total supply by a factor of 10.\n\n**Note that, in addition, it is proposed that the ICF will be entirely slashed**.\n\n\u003e [!NOTE]\n\u003e In the context of this proposal, the term *voting* ATOM is intended to refer\n\u003e to ATOM that was used to vote on proposal 848 either directly or indirectly\n\u003e via delegation. A *non-voting* ATOM is ATOM that was not used to vote either\n\u003e directly or indirectly because the validator it is delegated to also did not\n\u003e vote. The final balance for each account will be the result of the\n\u003e contributions from each ATOM with which the account either voted (and how),\n\u003e or did not.\n\n\u003e [!IMPORTANT]\n\u003e The following proposed mechanism does not explicitly account for the `K = 0.1`\n\u003e decimation factor. This factor is considered implicit as it will be applied\n\u003e indiscriminately alongside any other category-specific multiplier\n\n1. **YES Votes to Proposal 848**: standard 1x multiplier for the ATOM that\n   voted *YES* at the snapshot.\n\n2. **NO and NWV Votes to Proposal 848**: \n   1. Acknowledged with a 8x multiplier on top of the ATOM that voted *NO* and\n   *NWV*, emphasizing the critical stance against the monetary token proposition\n   and alignment with AtomOne's security philosophy. The resulting balance will\n   essentially be 9x the original ATOM balance.\n\n   2. Plus, the ATOM that voted *NWV* will also get a 3% bonus on top in\n   order to (slightly) reward the stronger political stance.\n\n3. **ABSTAIN Votes to Proposal 848**: Assigned a multiplier `C` that ensures\n   that the total percentage ownership of the *Abstain*, *Did Not Vote* (DNV)\n   and *Not Staked* categories does not exceed a target percentage `t` of 1/3:\n   ```math\n   C = (t / (1 - t)) * ((y + 9n + 9nwv) / (a + dnv + u))\n   ```\n   where:\n   - `C` is the multiplier to be found\n   - `t` is the target percentage for the *non-voting* categories, which is *33%*.\n   - `y` represents the total ATOM that voted *Yes*\n   - `a` represents the total ATOM that voted *Abstain*\n   - `n` represents the total ATOM that voted *No*\n   - `nwv` represents the total ATOM that voted *No With Veto*\n   - `dnv` represents the total ATOM that *Did Not Vote*\n   - `u` represents the total ATOM that *Unbonded* (*Not Staked*)\n\n4. **Did not vote (DNV) on Proposal 848**: It is considered to be *non-voting*\n   the ATOM that did not vote at all (even through its delegations). The ATOM\n   that *DNV* get the same multiplier as ATOM that voted *Abstain*, but they\n   incur in an additional 3% malus to (slightly) punish inactivity.\n\n5. **Unbonded ATOM (Not Staked)**: will equate to the *non-voting* category and\n   receive the same multiplier as ATOM that *DNV*.\n\nThe following table is also provided for a quick recap:\n\n|                     |  DNV      | YES | ABSTAIN | NO |    NWV    |\n|---------------------|-----------|-----|---------|----|-----------|\n| Bonded multiplier   | C x malus |  1  |    C    | 9  | 9 x bonus |\n| Unbonded multiplier | C x malus |  -  |    -    | -  |     -     |\n\n\u003e [!NOTE]\n\u003e *bonus* and *malus* are multipliers, respectively equal to `1.03` and `0.97`\n\u003e as per the above specifications. These multipliers incorporate the original\n\u003e quantity and the actual bonus/malus, i.e. they are computed as `1 + 0.3` and\n\u003e `1 - 0.3` respectively.\n\nAccompanying code that implements the proposed distribution mechanism is\navailable at [https://github.com/atomone-hub/govbox](https://github.com/atomone-hub/govbox). Please refer to the \n[PROP-001.md](https://github.com/atomone-hub/govbox/blob/master/PROP-001.md)\ndocument for a more detailed breakdown and further details on code, data and\napplied formulae.\nTo obtain the final distribution, we also apply a decimation factor `K = 0.1`\nwhen computing balances.\nAccording to the current calculations - which **may** change - the potential\nATONE distribution will be of approximately ~97 Millions.\n\n|                   |   TOTAL    | DID NOT VOTE |    YES    |     NO     | NOWITHVETO |  ABSTAIN  | NOT STAKED |\n|-------------------|------------|--------------|-----------|------------|------------|-----------|------------|\n| ATONE Distributed | 96,997,800 |   10,445,719 | 6,374,676 | 48,015,988 | 10,780,005 | 5,672,466 | 15,708,946 |\n| *% Ownership*     |            | 11%          | 7%        | 50%        | 11%        | 6%        | 16%        |\n| *% ATOM prop 848* |            | 20%          | 21%       | 16%        | 3%         | 10%       | 30%        |\n\n- The proposed ATONE supply is around ~2/7 (28.29%) of the ATOM supply at the \n  time of proposal 848.\n- The `C` multiplier is computed as ~1,620.\n- The ICF slashing represents a total of 12,677,878 ATOM\n\n\u003e [!WARNING]\n\u003e While we have explained and detailed the proposed methodology, we cannot\n\u003e guarantee the accuracy of reliability of any of the accompanying code and \n\u003e resulting preliminary data. Although every effort has been made to ensure\n\u003e accuracy and reliability, there is no guarantee that the tools will remain\n\u003e unchanged or error-free as further developments occur. Voters should exercise\n\u003e caution and discretion when utilizing these tools, and understand that any\n\u003e information or calculations provided by them are subject to revision.\n\nWe acknowledge there are additional details to be discussed for the final ATONE\ndistribution, such as for example \n[issue #13](https://github.com/atomone-hub/genesis/issues/13)\nfrom the AtomOne genesis repo, but these are intentionally left out of this\nproposal as it only seeks to establish a baseline distribution mechanism.\n\n## Consequences\n\n* Establishes a fair and structured token distribution mechanism that aligns \n  with AtomOne's founding ethos.\n\n* Sets a precedent for future endeavors, demonstrating the importance \n  of community alignment and shared values in token distribution decisions.\n\n## Alternatives\n\nShould this proposal fail to reach approval from the community, alternative\ndistribution mechanisms might be discussed and used instead. We did not evaluate\nalternative mechanisms as part of this proposal, but the proposal methodology\nwas revised based on community feedback during the\n[GovGen Townhalls](https://github.com/atomone-hub/genesis/tree/main/GovGen_Townhalls).\n\n## Governance votes\n\n* **YES**: You support the outlined ATONE distribution mechanism, recognizing\n           the importance of aligning with AtomOne's core values and principles.\n* **NO**: You do not support the proposed distribution mechanism and advocate for\n          an alternative approach.\n* **NO WITH VETO**: You strongly oppose the proposal due to perceived inequities\n                    or deviations from AtomOne's foundational principles.\n* **ABSTAIN**: You prefer to contribute to quorum without endorsing or opposing\n  the proposal directly.\n",
  "title": "Equitable ATONE Distribution in the Spirit of AtomOne's Founding Principles",
  "type": "Text"
}
