{
  "deposit": "5000000000ugovgen",
  "description": "# AtomOne Roadmap\n\n## Phase -2: Preparation\n\n1. **Drafting and Documentation:- 75% completed**\n    * Draft the Articles of Constitution and complete the AtomOne proposed Constitution \n    * Draft the initial Law documents for the proposed MVP DAOs: Steering, Oversight, and the first Treasury DAO - The Buidl DAO (to be used for chain development)*\n    * Draft the proposed AtomOne roadmap and tokenomics\n2. **Proposing completed Articles:- 10% completed**\n    * Begin proposing Constitution Amendments and Articles.\n3. **Chain's supply distribution: 100% completed**\n    * Complete the draft for the proposed ATONE supply distribution\n4. **Software choice research 100% completed**\n    * Complete the research for proposing the AtomOne launch software\n*\\* The names of the proposed DAOs can be subject to change.*\n\u003cbr\u003e\n\n## Phase -1: Finalizing Founding Documents\n\n1. **Governance Approval- 30% completed**\n    * Publish the AtomOne's proposed roadmap and submit it to Govgen for vote (feedback and sentiment).\n    * Publish the AtomOne's proposed tokenomics and submit it to Govgen for vote (feedback and sentiment).\n    * Publish the AtomOne's software choice proposal and submit it to Govgen for vote (feedback and sentiment).\n    * Publish the AtomOne's supply distribution proposal and submit it to Govgen for vote (feedback and sentiment).\n    * Publish the AtomOne proposed completed Constitution and submit it to Govgen for vote (feedback and sentiment).\n2. **Complete the burn mechanism spec from ATONE to Photon- 10% completed**\n\u003cbr\u003e\n\n## Phase 0: AtomOne Chain Launch\n\n1. **Launch**\n    * Launch the AtomOne chain with a simple Gaia fork and no, to minimal changes with ICS and IBC functionalities disabled. \n    * Ratify all governance documents on the AtomOne chain: Articles of Constitution and if required the proposed AtomOne roadmap and tokenomics\n\u003cbr\u003e\n\n## **Phase 1: Implementation**\n\n1. **New features/changes implemented**\n    * Governance improvements\n    * PHOTON mechanics\n    * IBC, including relay \u0026 fee-based spam prevention. \n    * Audit all of the above\n2. **Photon activation**\n    * ATONE -\u003e PHOTON burn mechanism enabled\n    * ATONE only used as fees for PHOTON burn tx\n    * All fees collected in PHOTONs\n\n3. **DAO Activation**\n\n    * Complete the Charters for the Steering, Oversight, and the first Treasury DAO - The Buidl DAO* and submit them to AtomOne for vote\n    * Complete the Law documents for the proposed MVP DAOs and submit them to AtomOne for vote.\n    * Approval of DAO members. \n        * Propose through AtomOne:\n            1. Steering Committee Members\n            2. Oversight Committee Members\n            3. The first Treasury DAO - The Buidl DAO Committee Members\n        * Set up individual addresses for all Steering, Oversight members and for the first Treasury DAO - The Buidl DAO and KYC if needed\n    * Launch the SteeringDAO, the Oversight DAO and the first Treasury DAO - The Buidl DAO with on-chain representation (AtomOne multisig addresses for each DAO)  \n    * Enable full functionality for root chain proposals. Ex:\n        * Steering DAO can comment on root proposals.\n        * Oversight DAO can halt root proposals.\n        * Introduce new proposal types: Constitution, Law.\n        * Introduce new transaction types: ex: Bend Time \n    * Compile Constitution and afferent laws on-chain.\n    * Maintain an off-chain system that stores the Constitution laws and charters.\n\u003cbr\u003e\n\n## Phase 2: Validators, ICS Mechanics\n\n1. **Validator Incentives**\n    * Fix validator incentives and election mechanics.\n    * Implement rewards not strictly proportional to stake to avoid large validator dominance.\n\n2. **ICS**\n    * Propose the spec for the improved ICS model that:\n        1. ensures more or equal ICS rewards for validators.\n        2. collects and distributes ICS rewards according to work performed.\n        3. uses photons for all payments.\n    * Deploy above ICS on AtomOne.\n    * Start draft on ICS++ specification w/ ABCI application containers.\n        1. ICS++ consumer chains are described by a linux container.\n        2. Develop orchestration tooling for ICS++\n        3. Ensure TM1 \u0026lt;-\u003e TM2 IBC compatibility\n        4. Expand choice of supported consensus engines for consumer chains. (Hub runs TM1, initial ICS++ consumer chains run TM2 invisibly)\n\u003cbr\u003e\n\n## Phase 3: Cross-Zone Governance\n\n1. **Expanded Oversight of the DAOs**\n    * Allow Oversight DAO to reject proposals from other zones via root/core.\n    * Enable Steering DAO to manage root hub parameters and pass them through IBC to shard treasury DAOs.\n2. **Enable the creation and functionality of the other Treasury DAOs**\n    * Enable the needed functionality for the creation of any treasury DAOs\n",
  "title": "AtomOne Roadmap",
  "type": "Text"
}
